Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཇི་ལྟ ར་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ བརྟན་པོ་ ཡིན་པ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འདུན་པ་ ཇི་ལྟ་བུ ས་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཡང་དག་ པར་ སྒྲུབ་པ ར་ བྱེད་པ་ དེ་ ལེགས་པ ར་ རབ་ཏུ་ ཉོན་ ལ་ ཡིད་ ལ་ ཟུང་ ཤིག་ དང་ ངས་ ཁྱོད་ ལ་ [122b] བཤད་ དོ །_།
en: $1008 “Śāradvatī­putra, listen well and keep in mind what I will now tell you about exactly how firm bodhisattva great beings are with respect to unexcelled and perfect awakening, and just how bodhisattva great beings, through their resolve, accomplish the wisdom of awakening. [122.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་ ན །_ |#| བསྐལ་པ་ གྲངས་མེད་པ འི་ ཡང་ ཆེས་ གྲངས་མེད་པ་ ཡངས་པ་ ཚད་ མེད་པ་ བྱུང་བ ར་ གྱུར་པ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིག་པ་ དང་ ཞབས་ སུ་ ལྡན་པ །_ བདེ་བ ར་ གཤེགས་པ །_ འཇིག་རྟེན་ མཁྱེན་པ །_ སྐྱེས་བུ་ འདུལ་བ འི་ ཁ་ལོ་ སྒྱུར་བ །_ བླ་ ན་ |#| མེད་པ །_ ལྷ་ རྣམས་ དང་ མི་ རྣམས་ ཀྱི་ སྟོན་པ །_ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ བདེ་བ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ འཇིག་རྟེན་ དུ་ བྱུང་ སྟེ
en: $1009 “Śāradvatī­putra, long ago, immeasurably vast and countless beyond countless eons ago, there appeared in the world a thus-gone one, a worthy one, a perfect buddha, someone wise and virtuous, a blissful one, a knower of the world, a steersman taming beings, an unsurpassable one, a teacher of gods and humans, a blessed buddha by the name of Sukharāja.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ བདེ་ བ འི་ རྒྱལ་པོ འི་ ཚེ འི་ ཚད་ ནི་ ལོ་ བདུན་ ཁྲི་ཐུབ་ པར་ གྱུར་ ཏོ །_།
en: Śāradvatī­putra, Sukharāja’s lifespan was seventy thousand years.

source: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོ་ དེ འི་ ཉན་ཐོས་ འདུས་པ་ གཅིག་ ནི་ དགྲ་བཅོམ་པ་ བྱེ་ བ་ ཕྲག་ ཉི་ཤུ ར་ གྱུར་ ཏོ །_།
en: The thus-gone one, the worthy one, the perfect buddha Sukharāja had three assemblies of hearers: the first consisted of two hundred million arhats,

source: གཉིས་པ་ ནི་ དགྲ་བཅོམ་པ་ བྱེ་ བ་ ཕྲག་ བཞི་ བཅུ ར་ གྱུར་ ཏོ །_།
en: the second was four hundred million arhats, and

source: འདུས་པ་ གསུམ་པ་ ནི་ དགྲ་བཅོམ་པ་ བྱེ་ བ་ ཕྲག་ དྲུག་ ཁྲི ར་ གྱུར་ ཏོ །_།
en: the third was six hundred billion arhats.

source: དེ འི་ ཚེ་ འཛམ་བུ འི་ གླིང་ དེ་ ནི་ ཡངས་ ཤིང་ རྒྱ་ཆེ་བ ར་ གྱུར་ ཏེ །_ |#| དཔག་ཚད་ འབུམ་ཕྲག་ དགུ་ བཅུ་ ཡོད་ དོ །_།
en: $1010 “Back then, that Jambudvīpa was broad and vast, extending across nine million leagues.

source: དེ འི་ ཚེ་ འཛམ་བུ འི་ གླིང་ དེ་ ན་ གྲོང་ཁྱེར་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: It had eighty-four thousand cities and

source: ཐམས་ཅད་ ཀྱང་ རིན་པོ་ཆེ་ སྣ་ བདུན་ གསེར་ དང་ །_ དངུལ་ དང་ །_ ཤེལ་ དང་ །_ བཻ་ དཱུརྱ་ དང་ །_ སྤུག་ དང་ །_ རྡོ འི་ སྙིང་པོ་ དང་ །_ བདུན་པ་ མུ་ཏིག་ དམར་པོ་ ལས་ བྱས་པ་ བཀྲ་བ །_ བལྟ་ ན་ |#| སྡུག་པ །_
en: all of them were brilliant and exquisite, fashioned from the seven kinds of precious substances: gold, silver, crystal, cat’s eye, coral, emerald, and red pearl.

source: ཆུ་ དང་ སྲིད་ དུ་ ནི་ དཔག་ཚད་ བཅུ་གཉིས་ ཡོད་ ལ །_ ཞེང་ དུ་ ནི་ དཔག་ཚད་ བདུན་ ཡོད་པ འོ །_།
en: The cities were twelve leagues in length, and seven leagues in width.

source: ཐམས་ ཅད་ ཀྱང་ འབྱོར་པ །_ རྒྱས་པ །_ བདེ་བ །_ ཉམས་ དགའ་བ །_ ལོ་ལེགས་པ །_ སྐྱེ་བོ་ མང་པོ ས་ གང་བ འོ །_།
en: They were all wealthy, healthy, happy, pleasant, abundant in food, and well populated.

source: གྲོང་ཁྱེར་ ཆེན་པོ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ ཁོར་ཡུག་ ཏུ་ ར་བ་ རིམ་ བདུན་ དང་ །_ འོབས་ རིམ་ བདུན་ གྱིས་ ཡོངས་སུ་ བསྐོར་བ འོ །_།
en: All the cities were surrounded by seven walls and seven moats.

source: འོབས་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ ཆུས་ གང་བ །_ ཀུན་ ནས་ རྗེས་སུ་ འབབ་པ འི་ ཆུ་ འབབ་པ །_ ཨུད་པ་ ལ་ དང་ །_ པད་མ་ དང་ །_ ཀུ་མུ་ད་ དང་ །_ པད་མ་ དཀར་པོ་ དག་ གིས་ ཀུན་ དུ་ ཁེབས་ ཤིང་ །_ ངུར་པ་ དག་ གིས་ སྒྲ་ ཕྱུང་བ །_ བྱ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱི་ ཚོགས་ ངང་པ་ དང་ །_ ཁྲུང་ ཁྲུང་ དང་ །_ རྨ་བྱ་ དང་ །_ ནེ་ཙོ་ དང་ །_ རི་སྐེགས་ [123a] དང་ །_ ཁུ་བྱུག་ དང་ །_ ཤང་ཤང་ཏེའུ་ དག་ གིས་ སྒྲ་ ཡང་དག་ པར་ བརྗོད་པ འོ །_།
en: All the moats were filled with water that was flowing all around, covered with blue, red, pink, and white lotus flowers, and resounding with the sounds of ducks and various other birds, like geese, herons, peacocks, parrots, myna birds, [123.a] cuckoos, and pheasants.

source: འོབས་ ཀྱི་ འགྲམ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ |#| རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ གྲུབ་པ འི་ ཤིང་ ལྗོན་པ་ དག་ གིས་ ཁྱབ་པ ར་ གྱུར་པ འོ །_།
en: $1011 “All the banks of the moats were filled with trees composed of the seven precious substances—

source: གསེར་ གྱི་ ཤིང་ ལྗོན་པ་ དག་ ལ །_ ཡལ་ག་ དག་ ནི་ དངུལ །_ འདབ་མ་ དག་ ནི་ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ །_ ལོ་མ་ དག་ ནི་ རྡོ འི་ སྙིང་པོ །_ མེ་ཏོག་ དག་ ནི་ ཤེལ །_ འབྲས་བུ་ དག་ ནི་ སྤུག _། སྡོང་བུ་ དག་ ནི་ མུ་ཏིག་ དམར་པོ་ དང་ །_
en: trees of gold with branches of silver, leaves of cat’s eye, shoots of emerald, flowers of crystal, fruits of coral, and stalks of red pearl;

source: དངུལ་ གྱི་ ཤིང་ ལྗོན་པ་ དག་ ལ །_ ཡལ་ག་ དག་ ནི་ གསེར །_ འདབ་མ་ དག་ ནི་ ཤེལ །_ ལོ་མ་ དག་ ནི་ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ །_ འབྲས་བུ་ དག་ ནི་ སྤུག _། མེ་ཏོག་ དག་ ནི་ རྡོ འི་ སྙིང་པོ །_ སྡོང་བུ་ དག་ ནི་ མུ་ཏིག་ དམར་པོ་ དང་ །_
en: trees of silver with branches of gold, leaves of crystal, shoots of cat’s eye, fruits of coral, flowers of emerald, and stalks of red pearl;

source: ཤེལ་ གྱི་ ཤིང་ ལྗོན་པ་ དག་ ལ །_ སྡོང་པོ་ དག་ ནི་ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ །_ ལོ་མ་ དག་ ནི་ གསེར །_ འདབ་མ་ དག་ ནི་ དངུལ །_ མེ་ཏོག་ དག་ ནི་ སྤུག _། འབྲས་བུ་ དག་ ནི་ རྡོ འི་ སྙིང་པོ །_ སྡོང་བུ་ དག་ ནི་ མུ་ཏིག་ དམར་པོ་ དང་ །_
en: trees of crystal with trunks of cat’s eye, shoots of gold, leaves of silver, flowers of coral, fruits of emerald, and stalks of red pearl;

source: སྤུག་ གི་ ཤིང་ ལྗོན་པ་ དག་ ལ །_ སྡོང་པོ་ དག་ ནི་ རྡོ འི་ སྙིང་པོ །_ ལོ་མ་ དག་ ནི་ མུ་ཏིག་ དམར་པོ །_ འདབ་མ་ དག་ ནི་ དངུལ །_ མེ་ཏོག་ དག་ ནི་ གསེར །_ འབྲས་བུ་ དག་ ནི་ ཤེལ །_ རྩ་བ་ དག་ ནི་ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ་ དང་ །_
en: trees of coral with trunks of emerald, shoots of red pearl, leaves of silver, flowers of gold, fruits of crystal, and roots of cat’s eye;

source: རྡོ འི་ སྙིང་པོ འི་ ཤིང་ ལྗོན་པ་ དག་ ལ །_ སྡོང་པོ་ དག་ ནི་ མུ་ཏིག་ དམར་པོ །_ ལོ་མ་ དག་ ནི་ དངུལ །_ འདབ་མ་ དག་ ནི་ གསེར །_ མེ་ཏོག་ དག་ ནི་ ཤེལ །_ འབྲས་བུ་ དག་ ནི་ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ །_ རྩ་བ་ དག་ ནི་ སྤུག་ དང་ །_
en: trees of emerald with trunks of red pearl, shoots of silver, leaves of gold, flowers of crystal, fruits of cat’s eye, and roots of coral;

source: མུ་ཏིག་ དམར་པོ འི་ ཤིང་ ལྗོན་པ་ དག་ ལ །_ སྡོང་པོ་ དག་ ནི་ གསེར་ ལས་ གྲུབ་པ །_ ལོ་མ་ དག་ ནི་ དངུལ །_ འདབ་མ་ དག་ ནི་ ཤེལ །_ མེ་ཏོག་ དག་ ནི་ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ །_ འབྲས་བུ་ དག་ ནི་ སྤུག་ ལས་ གྲུབ་པ །_ རྩ་བ་ དག་ ནི་ རྡོ འི་ སྙིང་པོ་ ལས་ གྲུབ་པ །_
en: and trees of red pearl with trunks of gold, shoots of silver, leaves of crystal, flowers of cat’s eye, fruits of coral, and roots of emerald.

source: གྲོང་ཁྱེར་ ཆེན་པོ་ དེ་དག་ ན་ གྲོང་ཁྱེར་ ཆེན་པོ་ རེ་རེ་ ན་ ཡང་ སྐྱེད་མོས་ཚལ་ བརྒྱད་ ཁྲི་ བརྒྱད་ ཁྲི་ ཡོད་ དེ །_ |#| ཐམས་ཅད་ ཀྱང་ དཔག་ཚད་ ཉི་ཤུ་པ འོ །_།
en: $1012 “Each one of those cities had eighty thousand parks, each of which was twenty leagues square.

source: སྐྱེད་མོས་ཚལ་ བརྒྱད་ ཁྲི་པོ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ ཁོར་ཡུག་ ཏུ་ འོབས་ དག་ དང་ །_ རྟ་བབས་ རིམ་ བདུན་ དང་ །_ དྲིལ་བུ་ གཡེར་ ཀ འི་ དྲ་བ་ རིམ་ བདུན་ དང་ །_ སྟེགས་བུ་ རིམ་པ་ བདུན་ གྱིས་ བསྐོར་བ ར་ གྱུར་ ཏེ
en: Each of those eighty thousand parks was surrounded by moats, seven tiers of arched doorways, seven layers of lattices with tiny bells, and seven rows of altars.

source: ཚུལ་ སྔ་མ་ ཁོ་ན ས་ གོང་མ་ བཞིན་ དུ་ སྦྱར་བ ར་ བྱ་ སྟེ །_
en: In accordance with the previous description of the moats of the cities, [123.b]

source: ཇི་ལྟ ར་ གྲོང་ཁྱེར་ གྱི་ འོབས་ དག་ [123b] ལ་ བཀོད་པ་ དག་ བཞིན་ དུ་ སྐྱེད་མོས་ཚལ་ གྱི་ འོབས་ དག་ ལ་ ཡང་ བཀོད་པ་ དག་ ཀུན་ཤེས་ པར་ བྱ འོ །_།
en: it should be understood that the moats of the parks appeared in just the same way.

source: སྐྱེད་མོས་ཚལ་ དེ་ ལ་ ཡང་ ཙན་དན་ གྱི་ ལོ་མ་ དག་ དང་ །_ དུས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ འི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །_ རོལ་མོ འི་ སྒྲ འི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །_ རྒྱན་ གྱི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །_ མེ་ཏོག་ གི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །_ བཟའ་བ འི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །_ བཏུང་བ འི་ ཤིང་ ལྗོན་པ་ དག་ ཀྱང་ ཡོད་ དོ །_།
en: In addition, however, those parks had sandal tree shoots, seasonal trees, musical trees, ornamental trees, flowering trees, food-bearing trees, and drink-bearing trees.

source: སྐྱེད་མོས་ཚལ་ དེ་ ལ་ ཡང་ གསེར་ དང་ །_ དངུལ་ དང་ །_ ཤེལ་ དང་ །_ བཻ་ དཱུརྱ་ ལས་ གྲུབ་པ་ དང་ །_ སྤུག་ ལས་ གྲུབ་པ་ དང་ །_ མུ་ཏིག་ དམར་པོ་ ལས་ གྲུབ་པ འི་ ཤིང་ ལྗོན་ པ་ དག་ ཡོད་ དོ །_།
en: Those parks, moreover, had trees composed of gold, silver, crystal, cat’s eye, coral, and red pearl.

source: !དེ་དག་ ལ་ ཡང་ མེ་ཏོག་ སྐྱེས་པ །_ མེ་ཏོག་ ཨ་ ཏི་ མུག་ ཏ་ ཀ་ དང་ །_ ཙམ་པ་ཀ་ དང་ །_ བར་ ཤ་ ཀ་ དང་ །_ དྷ་ ནུ་ སྐ་ རི་ དང་ །_ མྱ་ངན་ འཚང་ དང་ །_ ནག་ དང་ །_ བལ་ ལ་ དང་ །_ ཏ་ ར་ ནི་ དང་ །_ གོ་ ཏ་ ར་ ནི་ དང་ །_ མན་ དཱ་ ར་བ་ དག་ དང་ །_ མེ་ཏོག་ ཁ་དོག་ ལྔ་པ་ དག་ དང་ །_ ཙན་ དྲོ་ ཏ་ ར་ ནི་ དག་ དང་ །_ དེ་དག་ དང་ གཞན་ ཡང་ མེ་ཏོག་ སྐྱེས་པ་ རྣམ་པ་ སྣ་ཚོགས་ དག་ ཡོད་ དོ །_།
en: On them grew flowers, such as atimuktaka flowers, campaka flowers, vārṣikī flowers, dhānuṣkari#44 flowers, aśoka flowers, black flowers, valla flowers, taraṇi flowers, gotaraṇi flowers, both kinds of mandārava flowers,#45 five-colored flowers, candrotaraṇi flowers, and many other different kinds.

source: སྐྱེད་མོས་ཚལ་ དེ་དག་ རེ་རེ་ ལ་ ཡང་ རྫིང་བུ་ སྟོང་ཕྲག་ བདུན་ བདུན་ བྱུང་བ ར་ གྱུར་ ཏེ །_
en: Each of those parks also had seven thousand ponds,

source: ཐམས་ཅད་ ཀྱང་ ཡན་ལག་ བརྒྱད་ དང་ ལྡན་པ འི་ ཆུས་ གང་བ །_ ཚད་ ནི་ དཔག་ཚད་ ཕྱེད་པ །_ རིན་ པོ་ཆེ་ སྣ་ བདུན་ ལས་ གྲུབ་པ །_ གསེར་ གྱི་ བྱེ་མ་ བདལ་བ །_ ཐེམ་སྐས་ བཞི་ དང་ ལྡན་པ འོ །_།
en: all of which were filled with water replete with the eight qualities, measured half a league across, were formed from the seven precious substances, were strewn with golden sand, and had four sets of steps.

source: རྫིང་བུ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རིན་པོ་ཆེ འི་ དྲ་བ ས་ ཀུན་ དུ་ ཁེབས་པ །_ ཨུད་པ་ ལ་ དང་ །_ པད་མ་ དང་ །_ ཀུ་མུ་ད་ དང་ །_ པད་མ་ དཀར་པོ་ དག་ གིས་ རབ་ཏུ་ གང་བ འོ །_།
en: All those ponds were also covered with jewel nets, and filled with blue, red, pink, and white lotuses.

source: དེ འི་ ཚེ་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ ཞེས་ བྱ་བ་ ཞིག་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: $1013 “At that time there was a king called Vīradatta.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ དེ འི་ གྲོང་ཁྱེར་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ དག་ ཏུ་ ཁྱིམ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཡོད་པར་ གྱུར་ ཏེ །_ |#| ཁྱིམ་ རེ་རེ ར་ ཡང་ བཙུན་མོ འི་ འཁོར་ གྱི་ བུད་མེད་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཡོད་པར་ གྱུར་ ཏོ །_།
en: Śāradvatī­putra, King Vīradatta had eighty-four thousand houses in his eighty-four thousand cities, with a harem of eighty-four thousand women in each house.

source: འཛམ་བུ འི་ གླིང་ དེར་ གྲོང་ཁྱེར་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་པོ་ དེ་དག་ གི་ དབུས་ སུ་ གྲོང་ཁྱེར་ ཆེན་པོ་ ཆུ ར་ དཔག་ཚད་ བརྒྱད་ ཁྲི་ ཡོད་པ །_ ཞེང་ དུ་ དཔག་ཚད་ བཞི་ ཁྲི་ ཡོད་པ །_ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ གྲུབ་པ །_ འབྱོར་པ །_ རྒྱས་པ །_ བདེ་བ །_ ལོ་ལེགས་པ །_ ཉམས་ དགའ་བ །_ མི འི་ སྐྱེ་བོ་ མང་པོ ས་ [124a] གང་བ་ གཅིག་ ཡོད་པར་ གྱུར་ ཏེ |#| དེ་ལྟ ར་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་བ ར་ བྱ འོ །_།
en: In that Jambudvīpa, at the center of those eighty-four thousand cities was a large city that was eighty thousand leagues in length and forty thousand leagues in width, composed of the seven precious substances, wealthy, healthy, happy, abundant in food, pleasant, and well populated, [124.a] just as previously described.

source: དེ འི་ ཚེ་ གྲོང་ཁྱེར་ ཆེན་པོ་ དེ འི་ དབུས་ སུ་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ གྱི་ ཁྱིམ་ རིན་པོ་ཆེ་ སྣ་ བདུན་ ཆུ་ཞེང་ དུ་ ཀུན་ ནས་ དཔག་ཚད་ བཅུ་ ཡོད་པ་ ཞིག་ བརྩིགས་པ ར་ གྱུར་ ཏེ །_
en: In the center of that large city was built one of Vīradatta’s houses, made from the seven precious substances and ten leagues square.

source: ཁྱིམ་ དེ་ ན་ ཡང་ གསེར་ ལས་ བྱས་པ འི་ པུ་ཤུ་ དང་ །_ ཁང་པ་ བརྩེགས་པ་ སྣ་ཚོགས་པ་ དག་ ཡོད་ དོ །_།
en: That house had an enclosure made of gold and multiple stories.

source: ཁྱིམ་ དེ འི་ དབུས་ སུ་ ཡང་ འདི་ལྟ་སྟེ་ དཔེར་ན །_ |#| ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱི་ ཁང་ བཟངས་ རྣམ་པར་ རྒྱལ་བྱེད་ ལྟ་བུ འི་ ཁང་ བཟངས་ ཤིག་ བརྩིགས་པ ར་ གྱུར་ ཏེ །_
en: At the center of that house was built a palace like Vaijayanta, the palace of Indra.

source: ཁང་ བཟངས་ དེ འི་ མིང་ ནི་ ཆོས་ ཞེས་ བྱ་བ ར་ གྱུར །_
en: It was called Dharma .

source: རྒྱལ་པོ་ དེ འི་ ཀུན་དགའ་ར་བ་ ནི་ ཆོས་ བཟངས་ ཞེས་ བྱ་བ ར་ གྱུར་ ཏེ །_
en: The king had a garden called Dharmabhadra.

source: ཁྱིམ་ དེ འི་ དབུས་ སུ་ ཡང་ སྐྱེད་མོས་ཚལ་ ཞིག་ ཡོད་པར་ གྱུར་ ཏོ །_། |#| སྐྱེད་མོས་ཚལ་ དེ་ཡང་ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ གྲུབ་པ འི་ མེ་ཏོག་ གི་ ཤིང་ ལྗོན་པ་ དང་ །_ སྤོས་ ཀྱི་ ཤིང་ ལྗོན་པ་ དང་ །_ རོལ་མོ འི་ སྒྲ་ འབྱུང་བ འི་ ཤིང་ ལྗོན་པ་ དང་ །_ རྒྱན་ གྱི་ ཤིང་ ལྗོན་པ་ དང་ །_ གོས་ ཀྱི་ ཤིང་ ལྗོན་པ་ རྣམ་པ་ སྣ་ཚོགས་ དག་ གིས་ ཀུན་ ནས་ སོ་སོ ར་ བརྒྱན་པ འོ །_།
en: In the center of the house there was also a park, which was decorated throughout with different kinds of incense-bearing trees, musical trees, ornamental trees, and fabric-bearing trees, all composed of the seven precious substances.

source: སྐྱེད་མོས་ཚལ་ དེ་ཡང་ མིག་མངས་ རིས་ སུ་ བྱས་པ འོ །_།
en: The park, moreover, was divided into multiple square sections.

source: ཁྱིམ་ དེ་ཡང་ ངོས་ བཞི ར་ རྟ་བབས་ བཙུགས་པ་ སྟེགས་བུ་ དང་ །_ ཀུན་ དུ་ བལྟ་བ འི་ ས་ དང་ །_ སྐར་ཁུང་ དག་ གིས་ མཛེས་པ ར་ བྱས་པ །_ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ བྱས་པ འི་ ཁང་པ་ བརྩེགས་པ་ བཀྲ་བ་ བལྟ་ ན་ |#| སྡུག་པ་ དག་ གིས་ ཀུན་ ནས་ སོ་སོ ར་ བརྒྱན་པ འོ །_།
en: The house also had four sides, which were each adorned all around with brilliant and exquisite upper chambers made of the seven precious substances, and ornamented with balconies with elevated arched doorways, lookout points, and windows.

source: དེ འི་ ཚེ་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ གྱི་ བཙུན་མོ་ དམ་པ་ གཙོ་ མོ་ལ ས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྔོན་ གྱི་ རྒྱལ་བ་ ལ་ ལྷག་པ ར་ བྱ་བ་ བྱས་པ །_ མཛེས་པ །_ བལྟ་ ན་ |#| སྡུག་པ །_ མཐུ་ ཆེ་བ །_ དབང་ ཆེ་བ ར་ གྲགས་པ །_ དཔལ་ དང་ གཟི་བརྗིད་ ཀྱིས་ འབར་བ འི་ བུ་ ཞིག་ བཙས་པ ར་ གྱུར་ ཏེ
en: $1014 “Once, King Vīradatta’s main wife gave birth to a son, a bodhisattva who had revered previous victorious ones. |#| He was exquisite, beautiful, powerful, renowned for his great influence, and shone with glory and majesty.

source: དེ་ བཙས་མ་ ཐག་ ཏུ་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ གྱིས་ འདི་ ནི་ དེ འི་ ལོངས་སྤྱོད་ དུ་ འགྱུར་བ་ ཡིན་ ནོ་ ཞེས་ གྲོང་ཁྱེར་ ཆེན་པོ་ དེ་ བྱིན་པ ར་ གྱུར་ ཏོ །_།
en: As soon as he was born, King Vīradatta gave him that city, saying, ‘This will be his to enjoy.’

source: དེ འི་ ཚེ་ ཉིན་ མོ་ བུ་མོ་ ས་ཡ་ ཕྲག་ བཞི་ གང་དག་ བྱུང་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ གྱིས་ གཞོན་ནུ འི་ ལོངས་སྤྱོད་ དུ་ བསླངས་ སོ །_།
en: King Vīradatta then took for the boy’s pleasure all the four million maidens that existed.

source: རྒྱལ་པོ་ དེ་ དང་ །_ སྐྱེ་དགུ འི་ བདག་མོ་ རིན་ཆེན་ མ་ དང་ །_ གྲོང་མི་ དང་ །_ ཡུལ་ གྱི་ མི་ དག་ གིས་ ཀྱང་ བསོད་ནམས་ མཆོག་ [124b] ཅེས་བྱ་བར་ མིང་ བཏགས་པ ར་ གྱུར་ ཏོ །_།
en: The king, his wife Precious , the townspeople, and the country people all gave him the name Puṇyottama. [124.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ བཙས་པ འི་ མོད་ ལ་ སྟེང་ གི་ བར་སྣང་ ལ་ ལྷ་ རྣམས་ ཀྱིས་ གླུ་དབྱངས་ རབ་ཏུ་ བླངས་ ཤིང་ །_ ལྷ འི་ ཙན་དན་ གྱི་ ཕྱེ་མ་ དག་ དང་ །_ ལྷ འི་ མེ་ཏོག་ མན་ དཱ་ ར་བ འི་ ཆར་པ་ དག་ ཕབ་པ ར་ གྱུར་ ཅིང་ །_ ཁྱེའུ་ འདི་ བཙས་པ་ བསོད་ནམས་ མཆོག _། ཁྱེའུ་ འདི་ བཙས་པ་ བསོད་ནམས་ མཆོག་ ཅེས་ ལྷ འི་ དབྱངས་ ཀྱིས་ ཀྱང་ ཡང་དག་ པར་ བརྗོད་པ འི་ ཕྱིར་ རོ །_།
en: Śāradvatī­putra, just as soon as the king’s son Puṇyottama was born, the gods sang songs from on high and showered down a rain of divine sandalwood powder and divine mandārava flowers, exclaiming in divine cadence, ‘Supreme merit, this child is born! |#| Supreme merit, this child is born!’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཕྱིར་ ན་ ཁྱེའུ་ དེ འི་ མིང་ བསོད་ནམས་ མཆོག་ ཅེས་བྱ་བ་ ཁོ་ན ར་ བཏགས་པ ར་ གྱུར་ ཏོ །_།
en: It is for that reason, Śāradvatī­putra, he was only named ‘Puṇyottama.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྒྱལ་པོ འི་ བུ་ བསོད་ནམས་ མཆོག་ དེ་ ནར་ སོན་ ནས་ བཙུན་མོ འི་ འཁོར་ གྱིས་ མདུན་ དུ་ བདར་ ཏེ །_ |#| སྐྱེད་མོས་ཚལ་ གྱི་ ས ར་ ཙན་དན་ ལས་ བྱས་པ འི་ གྲུ ར་ ཞུགས་ ནས་ སྐྱེས་པ་ མེད་པ འི་ འདོད་པ འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ གིས་ རྩེ་ ཞིང་ དགའ་མགུ ར་ སྤྱོད་ དོ །_།
en: $1015 “Śāradvatī­putra, when Prince Puṇyottama had come of age, he would embark on a sandalwood boat within the park grounds, attended by his harem, and partake in pleasures, dallying in the five sense pleasures of women.

source: དེ འི་ ཚེ་ ཡང་ རྒྱལ་ པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ཙན་དན་ གྱི་ གྲུ ར་ ཞུགས་ ནས །_
en: Once, while the prince was in the sandalwood boat,

source: དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ མེ་ དང་ །_ གསེར་ དང་ །_ ཟླ་བ་ དང་ །_ འཛམ་བུ འི་ ཆུ་བོ འི་ གསེར་ གྱི་ མདོག་ གི་ འོད་ཟེར་ བྱེ་བ་ ཕྲག་ འབུམ་ རབ་ཏུ་ འགྱེད་པ འི་ སྐུ་ དང་ ལྡན་པ་ སྐུ་སྐྱེ ས་ བུ་ཆེན་པོ འི་ མཚན་ སུམ་ཅུ་རྩ་གཉིས་ ཀྱིས་ སྤྲས་པ །_ གསེར་ ལྟར་ འབར་བ །_ རིན་པོ་ཆེ འི་ བཀོད་པ་ ལྟར་ བརྒྱན་པ །_ ཉན་ཐོས་ ཀྱི་ དགེ་འདུན་ གྱི་ དབུས་ ན་ ཆོས་སྟོན་པ་ མཐོང་ སྟེ
en: he saw the Thus-Gone One teaching the Dharma in the midst of an assembly of śrāvakas. |#| His body—radiating billions of light rays the color of fire, gold, moonlight, and gold from the Jāmbū River—was replete with the thirty-two marks of a great being, shone like gold, and was adorned like jewel inlay.

source: མཐོང་ ནས་ ཀྱང་ རྒྱལ་པོ འི་ བུ་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ འདི་ སྙམ་ དུ་ སེམས་པ ར་ གྱུར་ ཏེ །_
en: Seeing him, Prince Puṇyottama thought,

source: འདི་ ཅི་འདྲ་བ་ དེ་ འདྲ ར་ བདག་ ཀྱང་ གྱུར་ཅིག་ སྙམ་ མོ །_།
en: ‘May I too become exactly like that!’

source: དེ་ནས་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ རྣམ་པ་ དེ་ལྟ་ བུ འི་ སེམས་སྐྱེས་ ནས །_ |#| དེ་ མ་ ཐག་ ཏུ་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ དེ་ མི་སྣང་བ ར་ གྱུར་ ཏེ །_
en: No sooner had Puṇyottama formed that thought, than the body of the Thus-Gone One vanished,

source: དེ་ མི་སྣང་བ ར་ གྱུར་ ནས་ དེ་ མ་ ཐག་ ཏུ་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ སྡུག་བསྔལ་ ཞིང་ ཡིད་ མི་ བདེ་བ ར་ གྱུར་ ཏེ །_ |#| བུད་ མེད་ དག་ དང་ ཡང་ ལྷན་ཅིག་ རྩེ་བ ར་ མི་ བྱེད །_ |#| དགའ་བ ར་ མི་ བྱེད །_
en: leaving Puṇyottama anguished and in despair, unable even to dally with and enjoy his girls.

source: དགའ་མགུ ར་ སྤྱོད་པ ར་ མི་ བྱེད་ ཅིང་ །_ བུད་མེད་ དེ་དག་ ལ་ སྟེན་པ ར་ མི་ བྱེད་ དོ །_།
en: Incapable of partaking of such pleasures, he did not make love to them.

source: གྲུ་ དེ་ནས་ བྱུང་ སྟེ་ ཁང་པ་ བརྩེགས་པ ར་ ཞུགས་ ནས །_
en: After he disembarked and entered his quarters,

source: སྐྱིལ་མོ་ཀྲུང་ བཅས་ ཏེ་ ནམ་ཞིག་ དེ་བཞིན་ གཤེགས་པ་ དེ་ ཅི་འདྲ་བ་ དེ་ འདྲ་བ་ ཉིད་ [125a] དུ་ བདག་ འགྱུར་ ཞིག་ གུ་ སྙམ་ སྟེ་ སེམས་པ་ ལ་ ཞུགས་ སོ །_།
en: he sat down with his legs crossed and immersed himself in the thought, ‘May I one day become exactly like that thus-gone one.’ [125.a]

source: དེ་ནས་ རྒྱལ་པོ འི་ གཞོན་ནུ་ དེ འི་ ཐད་ དུ་ བུད་མེད་ གང་དག་ འོང་བ་ དེ་དག་ ཐམས་ཅད་ རྒྱང་རིང་པོ་ ཁོ་ན་ ནས་ མཐོང་ ནས །_
en: $1016 “Now, whenever Prince Puṇyottama saw from afar that any girl was coming toward him,

source: རྒྱལ་པོ འི་ གཞོན་ནུ ས་ སྒོ་ དག་ བཅད་ དེ །_ |#| ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ འདོད་ཆགས་ ཀྱིས་ གང་བ་ ནད་ ཆེན་པོ ས་ སོ་སོ ར་ གཟིར་བ་ དག་ སྟེ །_
en: he shut the door and thought, ‘Alas! |#| These beings, filled with desire, are afflicted with a severe illness.

source: འདོད་ཆགས་ ཀྱིས་ གང་ ཞིང་ ནད་ ཆེན་པོ ས་ སོ་སོ ར་ གཟིར་བ འི་ སེམས་ཅན་ དེ་དག་ ལ་ བདག་ གིས་ ཀུན་ ཏུ་ སྤྱད་པ ར་ བྱས་ ན །_
en: What if I were to enjoy such beings, who, filled with desire, are afflicted with such a severe illness?

source: དེ་དག་ ནི་ རིགས་པ་ མ་ ཡིན་ ལ་ བདག་ ནི་ རིགས་པ་ ཡིན་པ འི་ ཕྱིར་ དེ་ ནི་ བདག་ གི་ ཆ་ མ་ཡིན་པ ར་ འགྱུར་ རོ །_།
en: Since they are improper and I am proper, that would not suit me.

source: སེམས་ ཅན་ འདི་དག་ ནི་ ཞེ་སྡང་ གིས་ གང་བ་ ནད་ ཆེན་པོ འི་ ནད་ ཀྱིས་ ཀུན་ དུ་ གཟིར་བ་ དག་ སྟེ །_
en: Those beings, filled with anger, are afflicted with a severe illness.

source: གལ་ཏེ་ ཞེ་སྡང་ གིས་ སོ་སོ ར་ གང་ ཞིང་ ནད་ ཆེན་པོ འི་ ནད་ ཀྱིས་ རབ་ཏུ་ གཟིར་བ འི་ སེམས་ཅན་ དེ་དག་ ལ་ ཡིད་ དུ་ འོང་བ་ དང་ བཅས་པ ར་ བྱས་ ན །_
en: What if I were to take pleasure in those beings, who, filled with anger, are afflicted with a severe illness?

source: དེ་དག་ ནི་ མི་རིགས་པ་ ཡིན་ ལ་ བདག་ ནི་ རིགས་པ་ ཡིན་ པ འི་ ཕྱིར །_ དེ་ ལ་ བྱེ་བྲག་ ཅི་ ཡོད་པར་ འགྱུར་ ཏེ །_
en: Since they are improper and I am proper, what a difference there will be—

source: བདག་ ནི་ སྐུ་ དེ་ལྟ་ བུ་ མངོན་པར་ བསྒྲུབ་པ ར་ བརྩོན་པ འོ །_།
en: I will strive to manifest a body like that of the Thus-Gone One.

source: ཀྱེ་མ་ བདག་ གིས་ རང་ གི་ སེམས་ ནི་ ཚར་ གཅད་པ ར་ བྱ །_
en: Ah! |#| I will restrain my own mind.

source: སེམས་ཅན་ དེ་དག་ ལ་ ནི་ གནོད་སེམས་ མི་ བསྐྱེད་པ ར་ བྱ འོ །_།
en: I will not have ill will toward those beings.

source: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ གཏི་མུག་ གིས་ གང་བ །_ ནད་ ཆེན་པོ འི་ ནད་ ཀྱིས་ ཀུན་ དུ་ གཟིར་བ་ དག་ སྟེ །_
en: Alas! |#| Those beings, filled with delusion, are afflicted with a severe illness.

source: གལ་ཏེ་ ནད་ ཆེན་པོ འི་ ནད་ ཀྱིས་ ཀུན་ ཏུ་ གཟིར་བ འི་ སེམས་ཅན་ དེ་དག་ ལ་ རྗེས་སུ་ འཇུག་པ ར་ བྱས་ ན །_
en: What if I were to follow beings afflicted with such a severe illness?

source: དེ་དག་ ནི་ མི་རིགས་པ་ ཡིན་ ལ་ བདག་ ནི་ རིགས་པ་ ཡིན་པ ས །_ དེ་ ལ་ བྱེ་བྲག་ ཅི་ ཡོད་པར་ འགྱུར་ ཏེ །_
en: Since they are improper and I am proper, what a difference there will be—

source: བདག་ ནི་ སྐུ་ དེ་ལྟ་ བུ་ མངོན་པར་ བསྒྲུབ་ པ ར་ བརྩོན་པ འོ །_།
en: I will strive to manifest such a sublime body.

source: སེམས་ཅན་ འདི་དག་ ནི་ ཕྲག་དོག་ དང་ །_ ཁྲོ་བ ས་ གང་བ་ ནད་ ཆེན་པོ འི་ ནད་ ཀྱིས་ ཀུན་ ཏུ་ གཟིར་བ་ དག་ སྟེ །_
en: Those beings, filled with jealousy and rage, are afflicted with a severe illness.

source: གལ་ཏེ་ སེམས་ཅན་ དེ་དག་ ལ་ བདག་ ཀུན་ དུ་ རྗེས་སུ་ འཇུག་པ ར་ བྱས་ ན །_
en: What if I were to follow those beings?

source: དེ་དག་ ནི་ མི་རིགས་པ་ ཡིན་ ལ །_ བདག་ ནི་ རིགས་པ་ ཡིན་པ ས །_ དེ་ ལ་ བྱེ་བྲག་ ཅི་ ཡོད་པར་ འགྱུར་ ཏེ །_
en: Since they are improper and I am proper, what a difference there will be—

source: བདག་ ནི་ སྐུ་ དེ་ལྟ་ བུ་ མངོན་པར་ བསྒྲུབ་པ ར་ བརྩོན་པ ར་ བྱ འོ །_།
en: I will strive to manifest such a sublime body.

source: ཀྱེ་མ་ བདག་ གིས་ ཕྲག་དོག་ མེད་པར་ བྱ །_
en: Ah! |#| I will remove jealousy!

source: སེར་སྣ་ ཅན་ མ་ཡིན་པ་ དང་ །_ རྨོངས་པ་ མེད་པ་ དང་ །_ འདོད་ཆགས་ དང་ བྲལ་བ་ དང་ །_ ཞེ་སྡང་ དང་ བྲལ་བ་ དང་ །_ གཏི་མུག་ དང་ བྲལ་བ ར་ བྱ་ ཞིང་ །_ སེམས་ཅན་ དེ་ [125b] དག་ ཉིད་ ལ་ ཡང་ བྱམས་པ འི་ སེམས་བསྐྱེད་ པར་ བྱ །_ |#| སྙིང་རྗེ་ བསྐྱེད་པ ར་ བྱ །_
en: I will not be stingy, I will remove stupidity, and, freeing myself of desire, anger, and delusion, [125.b] I will also have love and compassion for those very beings.

source: སེམས་ཅན་ དེ་དག་ ལམ་ གང་ དུ་ ཞུགས་ ན །_ |#| འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ དང་ །_ ཕྲག་དོག་ དང་ །_ ཁྲོ་བ་ དང་ །_ སེར་སྣ་ དང་ །_ སྒྱུ་ དང་ །_ གཡོ་ དང་ །_ ཐ་བ་ དང་ །_ ང་རྒྱལ་ ཐམས་ཅད་ རྒྱུན་ ཆད་པ ར་ འགྱུར །_ |#| སྤོང་བ ར་ འགྱུར །_ |#| མི་ སྟེན་པ ར་ འགྱུར །_ |#| མི་ སྒོམ་པ ར་ འགྱུར །_ |#| མང་ དུ་ མི་ བྱེད་པ ར་ འགྱུར་བ འི་ ལམ་ བཙལ་བ ར་ བྱ འོ་ སྙམ་ མོ །_།
en: I will seek a path that, when those beings embark upon it, brings an end to all their desire, anger, delusion, jealousy, rage, stinginess, treachery, deceit, aggression, and pride—a path by which they will discard, no longer indulge in, not habituate themselves to, nor increase any of these.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ལྟ ར་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ ཡིད་ མི་ དགའ་ ཞིང་ །_ སྐྱོ་བ ས་ མངོན་པར་ བརྩོན་ ཏེ་
en: Śāradvatī­putra, thus was Puṇyottama unhappy, and immersed in despair.

source: རྩེ་བ ར་ མི་ བྱེད །_ |#| དགའ་ བ ར་ མི་ བྱེད །_ |#| དགའ་མགུ ར་ སྤྱོད་པ ར་ མི་ བྱེད་ ཅིང་ །_ སུ འི་ ངོར་ ཡང་ ལྟ་བ ར་ མི་ བྱེད་ དོ །_།
en: He neither dallied in, nor enjoyed, nor took pleasure in anything, and did not show himself to anyone.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྒྱལ་པོ་ དཔ ས་ བྱིན་ གྱིས་ རྒྱལ་པོ འི་ གཞོན་ནུ་ བསོད་ནམས་ མཆོག་ རྩེ་བ ར་ མི་ བྱེད །_ |#| དགའ་བ ར་ མི་ བྱེད །_ |#| དགའ་མགུ ར་ སྤྱོད་པ ར་ མི་ བྱེད་ ཅིང་ །_ བུད་མེད་ མཐོང་ ན འང་ སྒོ་ གཅོད་པ ར་ བྱེད་ དོ་ ཞེས་ ཐོས་ ཏེ །_ |#| ཐོས་ ནས་ ཀྱང་
en: $1017 “Śāradvatī­putra, when King Vīradatta heard that Prince Puṇyottama was not dallying, enjoying himself, or celebrating, but would shut his door whenever he saw a girl,

source: རྒྱལ་པོ་ དཔ ས་ བྱིན་ དང་ །_ སྐྱེ་དགུ འི་ བདག་མོ་ རིན་ཆེན་ མ་ འདི་ སྙམ་ དུ་ སེམས་པ ར་ གྱུར་ ཏེ །_
en: King Vīradatta and his wife Precious thought,
